# 14. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

print ('Введите число:');

a = input () 

print (a[:-1])